<?php

/******************************************************************************
 *                                                                            *
 *   index.php, v 0.07 2007/07/26 - This is part of xBB library               *
 *   Copyright (C) 2006-2007  Dmitriy Skorobogatov  dima@pc.uz                *
 *                                                                            *
 *   This program is free software; you can redistribute it and/or modify     *
 *   it under the terms of the GNU General Public License as published by     *
 *   the Free Software Foundation; either version 2 of the License, or        *
 *   (at your option) any later version.                                      *
 *                                                                            *
 *   This program is distributed in the hope that it will be useful,          *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of           *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the            *
 *   GNU General Public License for more details.                             *
 *                                                                            *
 *   You should have received a copy of the GNU General Public License        *
 *   along with this program; if not, write to the Free Software              *
 *   Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA *
 *                                                                            *
 ******************************************************************************/

error_reporting(E_ALL | E_STRICT);
header('Content-type: text/html; charset=utf-8');
?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8" />
<title>xBBEditor demo</title>
<meta name="author" content="Dmitriy Skorobogatov" />
<link href="./style.css" rel="stylesheet" type="text/css" />
<script type="text/javascript" src='./xbb.js.php'></script>
<script type="text/javascript">
XBB.textarea_id = 'test_js'; // РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ textarea
XBB.area_width = '700px';
XBB.area_height = '400px';
XBB.state = 'plain'; // 'plain' or 'highlight'
XBB.lang = 'ru_utf8'; // Р»РѕРєР°Р»РёР·Р°С†РёСЏ
onload = function() {
    XBB.init(); // РёРЅРёС†РёР°Р»РёРёР·Р°С†РёСЏ СЂРµРґР°РєС‚РѕСЂР°
}
</script>
</head>
<body>

<table border="0" width="100%"><tr><td id="top">
<a href="http://xbb.uz"><img src="./images/xbb.jpg" alt="xBB" id="xbb_logo" /></a>
<div id="top_links"><a href="http://xbb.uz">Р”РѕРєСѓРјРµРЅС‚Р°С†РёСЏ</a></div>
<h1 id="top_h1">xBB - PHP-Р±РёР±Р»РёРѕС‚РµРєР° РґР»СЏ СЂР°Р±РѕС‚С‹ СЃ BBCode. Р’РµСЂСЃРёСЏ 0.29</h1>
</td></tr><tr valign="top"><td id="content">

<div align="center">
<form action="preview.php" name="test" target="_blank" method="post">
<textarea style="width:700px;height:400px" name="xbb_textarea" id="test_js">[h1 align=center]xBB РІРµСЂСЃРёРё 0.29[/h1]

РћСЃРЅРѕРІРЅС‹Рµ РѕС‚Р»РёС‡РёСЏ РѕС‚ РІРµСЂСЃРёРё 0.28:

[ol]
[*]РСЃРїСЂР°РІР»РµРЅС‹ Р±Р°РіРё. РўРµРіРё РЅРµ РґРѕР±Р°РІР»СЏР»РёСЃСЊ "РЅР° Р»РµС‚Сѓ", - РёСЃРїСЂР°РІР»РµРЅРѕ. РЎСЃС‹Р»РєРё РІРёРґР° [nobb]'www.С‡РµРіРѕ-С‚Рѕ'[/nobb] РїСЂРµРѕР±СЂР°Р·РѕРІС‹РІР°Р»РёСЃСЊ Рє РІРёРґСѓ [nobb]'./www.С‡РµРіРѕ-С‚Рѕ'[/nobb], - РёСЃРїСЂР°РІР»РµРЅРѕ. РўРµРїРµСЂСЊ РѕРЅРё, РєР°Рє РїРѕР»РѕР¶РµРЅРѕ, РїСЂРµРѕР±СЂР°Р·СѓСЋС‚СЃСЏ Рє РІРёРґСѓ [nobb]'http://www.С‡РµРіРѕ-С‚Рѕ'[/nobb].

[*]РЎ СѓС‡РµС‚РѕРј РѕСЃРѕР±РµРЅРЅРѕСЃС‚РµР№ IE (РєРѕРґ '&lt;br /&gt;&lt;br /&gt;' СЂР°РІРЅРѕСЃРёР»РµРЅ РєРѕРґСѓ '&lt;br /&gt;') РЅРµСЃРєРѕР»СЊРєРѕ РёР·РјРµРЅРµРЅРѕ С„РѕСЂРјР°С‚РёСЂРѕРІР°РЅРёРµ С‚РµРєСЃС‚Р°. РўРµРїРµСЂСЊ РІ IE С‚РµРєСЃС‚ РІС‹РіР»СЏРґРёС‚ Р±РѕР»РµРµ РѕР¶РёРґР°РµРјРѕ. Р’ РґСЂСѓРіРёС… Р±СЂР°СѓР·РµСЂР°С… РІСЃРµ РІС‹РіР»СЏРґРёС‚ РєР°Рє СЂР°РЅСЊС€Рµ.

[*]Р”РѕР±Р°РІР»РµРЅС‹ РЅРѕРІС‹Рµ С‚РµРіРё: [bbcode]@l;bdo@r;, @l;big@r;, @l;blockquote@r;, @l;br@r;, @l;cite@r;, @l;del@r;, @l;em@r;, @l;h4@r;, @l;h5@r;, @l;h6@r;, @l;ins@r;, @l;ol@r;, @l;p@r;, @l;pre@r;, @l;small@r;, @l;strong@r;, @l;ul@r;, @l;var@r;[/bbcode].

[*]РР·РјРµРЅРµРЅР° РєРѕРЅРІРµСЂС‚Р°С†РёСЏ РІ HTML С‚РµРіР° [bbcode]@l;quote@r;[/bbcode]. РљРѕРЅС‚РµР№РЅРµСЂ [tt]div[/tt] Р·Р°РјРµРЅРµРЅ РЅР° Р±РѕР»РµРµ СЃРµРјР°РЅС‚РёС‡РµСЃРєРё РїСЂР°РІРёР»СЊРЅС‹Р№ [tt]blockquote[/tt].

[*]РР·РјРµРЅРµРЅ РґРёР·Р°Р№РЅ С‚РµСЃС‚РѕРІС‹С… РїСЂРёРјРµСЂРѕРІ.
[/ol]

Р’РЅРµСЃРµРЅС‹ РёР·РјРµРЅРµРЅРёСЏ РІ [b]xBBEditor[/b]:

[ol]
[*]Р”Р»СЏ СѓСЃРєРѕСЂРµРЅРёСЏ Р·Р°РіСЂСѓР·РєРё Рё СЂР°Р±РѕС‚С‹, РїРѕРґРґРµСЂР¶Р°РЅРёСЏ СЂР°Р±РѕС‚РѕСЃРїРѕСЃРѕР±РЅРѕСЃС‚Рё СЂРµРґР°РєС‚РѕСЂР° РїСЂРё СЂР°Р·СЂС‹РІРµ СЃРѕРµРґРёРЅРµРЅРёСЏ РїСЂРёС€Р»РѕСЃСЊ РѕС‚РєР°Р·Р°С‚СЊСЃСЏ РѕС‚ С‚РµС…РЅРѕР»РѕРіРёРё Ajax РґР»СЏ РїРѕРґСЃРІРµС‚РєРё РєРѕРґР°. Р”Р»СЏ СЌС‚РѕРіРѕ РїР°СЂСЃРµСЂ Р±С‹Р» РїРµСЂРµРїРёСЃР°РЅ РЅР° РєР»РёРµРЅС‚СЃРєРѕРј JavaScript РІ РѕР±СЉРµРјРµ, РґРѕСЃС‚Р°С‚РѕС‡РЅРѕРј РґР»СЏ РїРѕРґСЃРІРµС‚РєРё РєРѕРґР°.

[*]РСЃРїСЂР°РІРёР» РіР»СЋРє. Р•СЃР»Рё С„РѕСЂРјР° СЃ СЂРµРґР°РєС‚РѕСЂРѕРј РЅР°С…РѕРґРёР»Р°СЃСЊ РІРЅРёР·Сѓ СЃС‚СЂР°РЅРёС†С‹, С‚Рѕ РїСЂРё Р·Р°РіСЂСѓР·РєРµ СЂРµРґР°РєС‚РѕСЂР° СЃС‚СЂР°РЅРёС†Р° РїСЂРѕРєСЂСѓС‡РёРІР°Р»Р°СЃСЊ РІРЅРёР·. РўРµРїРµСЂСЊ СЌС‚РѕРіРѕ РЅРµ РїСЂРѕРёСЃС…РѕРґРёС‚.

[*]РџРµСЂРµСЂР°Р±РѕС‚Р°Р» С‚СѓР»Р±Р°СЂ. РўРµРїРµСЂСЊ РІРЅРµС€РЅРёР№ РІРёРґ РєРЅРѕРїРѕРє РїСЂРё Р°РєС‚РёРІР°С†РёРё/РЅР°Р¶Р°С‚РёРё РјРµРЅСЏРµС‚СЃСЏ СЃСЂРµРґСЃС‚РІР°РјРё CSS, Р° РЅРµ РїСѓС‚РµРј РїРµСЂРµРіСЂСѓР·РєРё РєР°СЂС‚РёРЅРєРё. РўР°РєРёРј РѕР±СЂР°Р·РѕРј СѓРјРµРЅСЊС€РµРЅ РѕР±СЉРµРј Р·Р°РіСЂСѓР¶Р°РµРјС‹С… РєР°СЂС‚РёРЅРѕРє Рё С‚СѓР»Р±Р°СЂ РЅРµ "РµРґРµС‚" РІ СЃР»СѓС‡Р°Рµ СЂР°Р·СЂС‹РІР° СЃРѕРµРґРёРЅРµРЅРёСЏ СЃ РЅРµС‚РѕРј. РЈРјРµРЅСЊС€РµРЅ РІРµСЃ РІСЃРµС… РєРЅРѕРїРѕРє.

[*]РЈР±СЂР°Р» Р»РµРІСѓСЋ РїР°РЅРµР»СЊ. Р”Р»СЏ РІСЃС‚Р°РІРєРё СЃРјР°Р№Р»РёРєРѕРІ СЃРѕР·РґР°Р» СЃРїРµС†РёР°Р»СЊРЅСѓСЋ РєРЅРѕРїРєСѓ. Р”Р»СЏ РёРЅС„РѕСЂРјР°С†РёРё Рѕ РїСЂРѕРіСЂР°РјРјРµ, - С‚РѕР¶Рµ. РўРµРј СЃР°РјС‹Рј СЂР°СЃС€РёСЂРµРЅР° СЂР°Р±РѕС‡Р°СЏ РѕР±Р»Р°СЃС‚СЊ СЂРµРґР°РєС‚РѕСЂР°.

[*]РСЃРїСЂР°РІРёР» РіР»СЋРє. Р•СЃР»Рё СЂРµРґР°РєС‚РѕСЂ РЅР°С…РѕРґРёР»СЃСЏ РІ СЂРµР¶РёРјРµ РїРѕРґСЃРІРµС‚РєРё РєРѕРґР°, С‚Рѕ РІ FF РїСЂРё СЃР°Р±РјРёС‚Рµ С„РѕСЂРјС‹ РїСЂРѕРїРѕРґР°Р»Рё РїРµСЂРµРІРѕРґС‹ СЃС‚СЂРѕРє. РўРµРїРµСЂСЊ СЌС‚РѕРіРѕ РЅРµ РїСЂРѕРёСЃС…РѕРґРёС‚.

[*]Р”РѕР±Р°РІРёР» РєРЅРѕРїРєСѓ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕРіРѕ РїСЂРѕСЃРјРѕС‚СЂР°.

[*]РЎРѕР·РґР°Р» РµС‰Рµ РѕРґРёРЅ РєРѕРЅС„РёРіСѓСЂР°С†РёРѕРЅРЅС‹Р№ С„Р°Р№Р», РєРѕС‚РѕСЂС‹Р№ РѕРїСЂРµРґРµР»СЏРµС‚ СЃРїРёСЃРѕРє С€СЂРёС„С‚РѕРІ, РїР°Р»РёС‚СЂСѓ С†РІРµС‚РѕРІ Рё РѕСЃРЅРѕРІРЅС‹Рµ СЃРјР°Р№Р»РёРєРё, РїСЂРµРґР»Р°РіР°РµРјС‹Рµ РЅР° РІС‹Р±РѕСЂ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ.
[/ol]

РўРµРј РЅРµ РјРµРЅРЅРµ РґРѕР»Р¶РµРЅ РїСЂРµРґСѓРїСЂРµРґРёС‚СЊ, С‡С‚Рѕ [b]xBBEditor[/b] РїРѕРєР° РµС‰Рµ РѕСЃС‚Р°РµС‚СЃСЏ СЃС‹СЂС‹Рј СЌРєСЃРїРµСЂРёРјРµРЅС‚Р°Р»СЊРЅС‹Рј РїСЂРёР»РѕР¶РµРЅРёРµРј. РСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РµРіРѕ РІ СЂР°Р±РѕС‡РёС… РїСЂРѕРµРєС‚Р°С… СЂРµРєРѕРјРµРЅРґСѓРµС‚СЃСЏ СЃ Р±РѕР»СЊС€РѕР№ РѕСЃС‚РѕСЂРѕР¶РЅРѕСЃС‚СЊСЋ. РџР°СЂСЃРµСЂ xBB РЅРёРєР°Рє РЅРµ Р·Р°РІРёСЃРёС‚ РѕС‚ xBBEditor-Р° Рё РјРѕР¶РµС‚ Р±С‹С‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°РЅ РІ РїР°СЂРµ СЃ Р»СЋР±С‹Рј РґСЂСѓРіРёРј СЂРµРґР°РєС‚РѕСЂРѕРј РёР»Рё Р±РµР· РєР°РєРѕРіРѕ Р»РёР±Рѕ СЂРµРґР°РєС‚РѕСЂР°.

Р”РѕРєСѓРјРµРЅС‚Р°С†РёСЋ РёСЃРїСЂР°РІР»СЋ РІ Р±Р»РёР¶Р°Р№С€РµРµ РІСЂРµРјСЏ
[right][i][b]Р”РјРёС‚СЂРёР№ РЎРєРѕСЂРѕР±РѕРіР°С‚РѕРІ[/b], 25.07.2007[/i][/right]</textarea>
<br />&nbsp;<br />
<input type="submit" value="Send" />
</form>
</div>

</td></tr></table>
<div align="center">
<p align="center">&copy; 2006-2007, Dmitriy Skorobogatov</p>
<a href="http://sourceforge.net/projects/xbb-code/" target="_blank"><img
src="http://sourceforge.net/sflogo.php?group_id=192988" width="88"
height="31" border="0" alt="SourceForge.net Logo" /></a>
</div>
</body>
</html>
